In [5]:
import random as rdm
import pandas as pd
import numpy as np

In [84]:
df = pd.read_csv("salario.csv")
df.head()

   id           pais       estado     cidade  genero        data   salario
0   1  United States      Alabama     Mobile    Male  10/01/1987  $5407.86
1   2       Portugal        Porto       Rego    Male  29/11/2007  $7833.82
2   3         Sweden       Kalmar   Emmaboda    Male  23/06/1984  $5530.85
3   4         Sweden  Västmanland       Sala  Female  04/11/1983  $2803.76
4   5         France     Bretagne  Quimperlé  Female  18/11/1990  $2201.87

## Unindo os atributos de localidade

In [85]:
ids = df.id
cities = df.cidade
states = df.estado
countries = df.pais

In [86]:
locality = []
for i in range(len(cities)):
    locality.append([ids[i], str('{}, {}, {}'.format(cities[i], states[i], countries[i]))])

In [89]:
df_locality = pd.DataFrame(locality, columns=['id', 'localidade'])
df_locality.head()

   id                      localidade
0   1  Mobile, Alabama, United States
1   2           Rego, Porto, Portugal
2   3        Emmaboda, Kalmar, Sweden
3   4       Sala, Västmanland, Sweden
4   5     Quimperlé, Bretagne, France

## Unindo os dataframes

In [91]:
join_dataset = pd.concat([df, df_locality], axis=1, join='inner')
join_dataset.head()

,id,pais,estado,cidade,genero,data,salario,id,localidade
0,1,United States,Alabama,Mobile,Male,10/01/1987,$5407.86,1,"Mobile, Alabama, United States"
1,2,Portugal,Porto,Rego,Male,29/11/2007,$7833.82,2,"Rego, Porto, Portugal"
2,3,Sweden,Kalmar,Emmaboda,Male,23/06/1984,$5530.85,3,"Emmaboda, Kalmar, Sweden"
3,4,Sweden,Västmanland,Sala,Female,04/11/1983,$2803.76,4,"Sala, Västmanland, Sweden"
4,5,France,Bretagne,Quimperlé,Female,18/11/1990,$2201.87,5,"Quimperlé, Bretagne, France"

## Removendo atributos

In [94]:
dataset = join_dataset.drop(columns = ['id', 'pais', 'estado', 'cidade', 'salario'])
dataset.head()

   genero        data                      localidade
0    Male  10/01/1987  Mobile, Alabama, United States
1    Male  29/11/2007           Rego, Porto, Portugal
2    Male  23/06/1984        Emmaboda, Kalmar, Sweden
3  Female  04/11/1983       Sala, Västmanland, Sweden
4  Female  18/11/1990     Quimperlé, Bretagne, France

In [134]:
equivalent_classes = []
for i in range(len(dataset)):
    register = [dataset.iloc[i]['genero'], dataset.iloc[i]['data'], dataset.iloc[i]['localidade']]
    if register not in equivalent_classes:
        equivalent_classes.append(register)

In [136]:
len(equivalent_classes)

1000

In [133]:
a = equivalent_classes[0]
for i in range(len(dataset)):
    register = [dataset.iloc[i]['genero'], dataset.iloc[i]['data'], dataset.iloc[i]['localidade']]
    if register == a:
        print(register)

['Male', '10/01/1987', 'Mobile, Alabama, United States']

In [120]:
a = [['asb'], ['bsb']]
['asb'] in a

True

In [ ]:
class Generalizacao:
    def __init__(self,nome):
        self.filhos = []
        self.nome = nome
    def adicionarFilho(self,filho):
        if
    def toString(self):
ArvoreDatas = Generalizacao("**/**/****")

In [43]:
datas = []
for i in range(50):
    data = "%d/%d/%d"%(rdm.randint(1,2),rdm.randint(1,2),rdm.randint(2010,2011))
    datas.append(data)
datas

['2/2/2011',
 '2/2/2010',
 '2/1/2011',
 '1/2/2010',
 '2/2/2010',
 '1/2/2010',
 '1/1/2011',
 '1/1/2011',
 '2/1/2011',
 '1/2/2010',
 '2/2/2011',
 '2/2/2011',
 '1/2/2011',
 '2/1/2010',
 '1/1/2010',
 '2/1/2011',
 '1/2/2011',
 '1/2/2010',
 '2/1/2010',
 '2/1/2011',
 '1/2/2011',
 '2/1/2011',
 '1/2/2011',
 '2/2/2011',
 '2/1/2011',
 '2/1/2011',
 '2/2/2011',
 '2/2/2011',
 '2/1/2011',
 '2/2/2011',
 '2/2/2010',
 '2/2/2011',
 '1/1/2010',
 '2/2/2011',
 '1/2/2011',
 '1/1/2011',
 '2/2/2010',
 '2/2/2011',
 '2/2/2010',
 '2/2/2011',
 '1/1/2011',
 '1/2/2010',
 '1/2/2011',
 '2/1/2011',
 '2/1/2010',
 '1/2/2011',
 '1/2/2011',
 '1/2/2010',
 '2/1/2011',
 '2/1/2011']

In [45]:
a = [[data] for data in datas]

In [46]:
b = np.array(a)

In [47]:
df = pd.DataFrame(b)
type(df)

pandas.core.frame.DataFrame

In [50]:
print(df.groupby[0].count())
#df.groupby(0)[0]
#.to_frame()
for i in df.groupby(0):
    print(i)

TypeError: 'method' object is not subscriptable